package mylove2.test;
/***
 * @author CAT~sally (1WK)
 		//[SELFTEST001] 출력(1) 
  			Hello 출력
 
		//[SELFTEST002] 출력(2)
		    System.out.println(10 + 20); // 결과 : 10+20 문자열이 나오게 만들기
		    
		//[SELFTEST003] 입력   Scanner 테스트
		   	당신의 이름을 입력하세요. __입력받기
		 	당신의 이름은 __입니다.
		 
		//[SELFTEST004] IF (1형식)
		 * 1형식은 무조건 IF구문안을 읽는다. 모든과목 체크
		   	[1]국어점수를입력해주세요 __입력받기
		 	[2]영어점수를입력해주세요 __입력받기
		 	[3]수학점수를입력해주세요 __입력받기
		 	※ 과락인 모든과목을 출력해주세요.
		 	만약 국어점수가 40점 미만이라면 국어과락 
		   	만약 영어점수가 40점 미만이라면 영어과락 
		 	만약 수학점수가 40점 미만이라면 수학과락 
		 			 
		//[SELFTEST005] IF (2형식)
		 * 맞다 /틀리다
		   	당신의 나이를 입력하세요. __입력받기
		 	만약 19세 미만이라면 당신은  미성년자입니다.
		 	아니라면 성인입니다.
		 	
		//[SELFTEST006] If ~ ELSE (3형식)
		 * 여러개의 조건
		   	[1]국어점수를입력해주세요 __입력받기
		   	90점이상이라면 수	 / 80점 이상이라면 우/ 70점 이상이라면 미 /60점이상이라면 양 / 그 이외 가
		   	
		//[SELFTEST007] SWITCH
		 	a,b,c중에 입력해주세요
		 	a또는 A라면 apple
		 	b또는 B라면 banana
		 	c또는 C라면 coconut
		 	그이외 대소문자 관계없이 a,b,c만 입력가능합니다 
		
 *		//[SELFTEST008] for
 *			1,2,3,4,5,6,7,8,9,10 출력
 *
		//[SELFTEST009] while
 *			1,2,3,4,5,6,7,8,9,10 출력
		    
		//[SELFTEST010] do while 
 *			1,2,3,4,5,6,7,8,9,10 출력

		//[SELFTEST011] for
		 * 1~100사이를 입력할때까지 무한반복하기 
		 * 만약 1~100사이를 입력하면 빠져나오기			
		 
		//[SELFTEST012] while
		 * 1~100사이를 입력할때까지 무한반복하기 
		 * 만약 1~100사이를 입력하면 빠져나오기				
 ***/
public class PART001_SelfTest001_12 {

	public static void main(String[] args) {
 
	}

}
