package mylove2.test;

/***
 * @author CAT~sally (2WK)
 		//[SELFTEST013] for 응용
  			원하는 단을 입력하세요 _예) 2단
  			2*1 =2
   			2*2 =4 ...
  
		//[SELFTEST014] 이중for 응용
  			2~4단까지 출력하세요
		    
		//[SELFTEST015] 배열(1)
		    1. 문자형공간이 10개인  배열 ch 만들기
		    2. for구문을 이용하여  A~Z까지 입력
		    3. for구문을 이용하여  A~Z까지 출력
		    
		//[SELFTEST016] 배열(2)
		 	1. 2*3배열만들기
		 	2. for구문을 이용하여 다음과 같이 데이터 입력
		 	3. for구문을 이용하여 다음과 같이 데이터 출력
		 	   100	101 102
		 	   200	201 202
		 	   
		//[SELFTEST017] 이차원배열
		 	1.4*5 배열만들기
		 	2.배열에 1~20까지 데이터 입력
		 	3.다음과 같이 출력하기 
		 	
		 	1	2	3	4	5
		 	6	7	8	9	10
		 	11	12	13	14 	15
		 	16	17	18	19	20
		 	
		//[SELFTEST018] 함수(1) : 함수의 구조	
		   1. cat() 함수 정의하시오 : 접근(어디에서나) , 클래스멤버, 리턴값 void, 파라미터 없음
		   2. cat() 실행시 야옹출력
		
		//[SELFTEST019] 함수(2) : 파라미터
		   1. hap(3,5) 함수를 정의하시오 :  접근(어디에서나) , 클래스멤버, 리턴값 void, 파라미터 두개의 숫자를 입력받아줌
		   2. 기능 : 3+4+5 를 더한값을 출력해줌.
		   3. hap(3,5);	 // 결과값 :   두수 사이의 합 : 12
		
		//[SELFTEST020] 함수(3) : return 
		   1. 메인은 다음과 같다.
				System.out.println("[BASIC002] 윤년인지, 평년인지 판단해서 윤년이면 true, 평년이면 false리턴");			    
			    if(leap(2018)){
			      System.out.println("윤년");
			    }else{
			      System.out.println("평년"); // 출력
			    }		   
		   2. 윤년인지, 평년인지 판단해서 윤년이면 true, 평년이면 false리턴하는 함수를 정의하시오.
		  		※   윤년구하는공식 : 4의 배수이고 100으로 나뉘지 않음. 또한 400으로 나뉘면 윤년
		  		※   어디서든지 접근가능  클레스멤버  리턴값 boolean  함수이름 leap
				파라미터 정수형인자 1  (int n)   : 년도를 입력함.

		//[SELFTEST021] 함수(4) : 메서드오버로딩
		 	1. 다음의 결과가 나오게 메서드를 구현하시오		    
				print(3,5);			//결과값 :   8 출력
				print(1.2,3.4);		//결과값 :   4.6출력
				print('3','5');		//결과값 :   104
				print("3","5");		//결과값 :   35 출력		
		
		//[SELFTEST022] 함수(5) :  
			1. 메인이 다음과 같다.
				String[] name={"아이언맨","헐크","캡틴"};  
				disp(name); 	//결과값 :    아이언맨 , 헐크 , 캡틴 
			2. 위의 결과 처럼 결과값이 나오게 메서드를 구현하시오.	
		   
 ***/
public class PART001_SelfTest002_22 {

	public static void main(String[] args) {
	 
	}

}
